roles/doom/files/doom/.config/doom/config.org
#+TITLE: DOOM Emacs Config
#+AUTHOR: Jonas Schwind
#+DESCRIPTION: My Doom Emacs config
#+STARTUP: showeverything
#+PROPERTIES: header-args :tangle config.el
#+OPTIONS: toc:t
#+auto_tangle: t

* Table of Contents :toc:
- [[#about-this-file][About this file]]
- [[#whatever-that-is][Whatever that is]]
- [[#autosave][Autosave]]
- [[#beacon][Beacon]]
- [[#bookmarks-and-buffers][Bookmarks and Buffers]]
  - [[#bookmarks][Bookmarks]]
  - [[#buffers][Buffers]]
  - [[#global-auto-revert][Global Auto Revert]]
  - [[#keybindings-within-ibuffer-mode][Keybindings within ibuffer mode]]
- [[#centaur-tabs][Centaur-Tabs]]
- [[#dashboard][Dashboard]]
  - [[#splash][Splash]]
  - [[#menu][Menu]]
- [[#doom-theme][DOOM Theme]]
- [[#editor][Editor]]
  - [[#autoformat][Autoformat]]
  - [[#indentation][Indentation]]
  - [[#scrolloff][Scrolloff]]
- [[#elfeed][Elfeed]]
- [[#fonts][Fonts]]
  - [[#font-scale][Font scale]]
- [[#identification][Identification]]
- [[#line-settings][Line Settings]]
- [[#lsp][LSP]]
  - [[#bindings][Bindings]]
  - [[#java][Java]]
- [[#minimap][Minimap]]
- [[#modeline][Modeline]]
- [[#org-mode][Org-Mode]]
  - [[#org-fonts][Org Fonts]]
  - [[#org-agenda][Org Agenda]]
  - [[#org-auto-tangle][Org auto-tangle]]
  - [[#org-roam][Org-Roam]]
  - [[#org-roam-ui][Org-Roam-UI]]
- [[#rainbow-mode][Rainbow Mode]]
- [[#shells][Shells]]

* About this file

Place your private configuration here! Remember, you do not need to =doom sync= or =SCP h r r= after modifying this file!

Whenever you reconfigure a package, make sure to wrap your config in an =after!= block, otherwise Doom's defaults may override your settings. E.g.

#+begin_example emacs-lisp
(after! PACKAGE
    (setq x y))
#+end_example

The exceptions to this rule:

- Setting file/directory variables (like =org-directory=)
- Setting variables which explicitly tell you to set them before their package is loaded (see =C-h v VARIABLE= to look up their documentation).
- Setting doom variables (which start with =doom-= or =+=).

Here are some additional functions/macros that will help you configure Doom.

- =load!= for loading external *.el files relative to this one
- =use-package!= for configuring packages
- =after!= for running code after a package has loaded
- =add-load-path!= for adding directories to the =load-path=, relative to this file. Emacs searches the =load-path= when you load packages with =require= or =use-package=.
- =map!= for binding new keys

To get information about any of these functions/macros, move the cursor over the highlighted symbol at press =K= (non-evil users must press =C-c c k=).
This will open documentation for it, including demos of how they are used.
Alternatively, use =C-h o= to look up a symbol (functions, variables, faces, etc).

You can also try =gd= (or =C-c c d=) to jump to their definition and see how they are implemented.

* Whatever that is
I don't know if this was important beacuse it was commented out by default, ill keep this here just in case

 #+begin_src emacs-lisp :tangle yes
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-
#+end_src

* Autosave
Never ever loose files again

#+begin_src emacs-lisp :tangle yes
(setq auto-save-default t make-backup-files t)
#+end_src

* Beacon
Cursorflash on every big movement, never lose the cursor again.

#+begin_src emacs-lisp :tangle yes
(beacon-mode t)
#+end_src

* Bookmarks and Buffers
Doom Emacs uses =SPC b= for keybindings related to bookmarks and buffers.

** Bookmarks
Bookmarks are somewhat like registers in that they record positions you can jump to.
Unlike registers, they have long names, and they persist automatically from one Emacs session to the next.
The prototypical use of bookmarks is to record where you were reading in various files.

| COMMAND         | DESCRIPTION                            | KEYBINDING |
|-----------------+----------------------------------------+------------|
| list-bookmarks  | /List bookmarks/                         | SPC b L    |
| bookmark-set    | /Set bookmark/                           | SPC b m    |
| bookmark-delete | /Delete bookmark/                        | SPC b M    |
| bookmark-save   | /Save current bookmark to bookmark file/ | SPC b w    |

#+begin_src emacs-lisp :tangle yes
(setq bookmark-default-file "~/.config/doom/bookmarks")

(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks"                          "L" #'list-bookmarks
       :desc "Set bookmark"                            "m" #'bookmark-set
       :desc "Delete bookmark"                         "M" #'bookmark-set
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))
#+end_src

** Buffers
Regarding /buffers/, the text you are editing in Emacs resides in an object called a /buffer/.
Each time you visit a file, a buffer is used to hold the file’s text.
Each time you invoke Dired, a buffer is used to hold the directory listing.
/Ibuffer/ is a program that lists all of your Emacs /buffers/, allowing you to navigate between them and filter them.

| COMMAND         | DESCRIPTION          | KEYBINDING |
|-----------------+----------------------+------------|
| ibuffer         | /Launch ibuffer/       | SPC b i    |
| kill-buffer     | /Kill current buffer/  | SPC b k    |
| next-buffer     | /Goto next buffer/     | SPC b n    |
| previous-buffer | /Goto previous buffer/ | SPC b p    |
| save-buffer     | /Save current buffer/  | SPC b s    |

** Global Auto Revert
A buffer can get out of sync with respect to its visited file on disk if that file is changed by another program.
To keep it up to date, you can enable Auto Revert mode by typing =M-x auto-revert-mode=, or you can set it to be turned on globally with =global-auto-revert-mode=.
I have also turned on Global Auto Revert on non-file buffers, which is especially useful for 'dired' buffers.

#+begin_src emacs-lisp :tangle yes
(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)
#+end_src

** Keybindings within ibuffer mode
| COMMAND                           | DESCRIPTION                            | KEYBINDING |
|-----------------------------------+----------------------------------------+------------|
| ibuffer-mark-forward              | /Mark the buffer/                        | m          |
| ibuffer-unmark-forward            | /Unmark the buffer/                      | u          |
| ibuffer-do-kill-on-deletion-marks | /Kill the marked buffers/                | x          |
| ibuffer-filter-by-content         | /Ibuffer filter by content/              | f c        |
| ibuffer-filter-by-directory       | /Ibuffer filter by directory/            | f d        |
| ibuffer-filter-by-filename        | /Ibuffer filter by filename (full path)/ | f f        |
| ibuffer-filter-by-mode            | /Ibuffer filter by mode/                 | f m        |
| ibuffer-filter-by-name            | /Ibuffer filter by name/                 | f n        |
| ibuffer-filter-disable            | /Disable ibuffer filter/                 | f x        |
| ibuffer-do-kill-lines             | /Hide marked buffers/                    | g h        |
| ibuffer-update                    | /Restore hidden buffers/                 | g H        |

#+begin_src emacs-lisp
(evil-define-key 'normal ibuffer-mode-map
  (kbd "f c") 'ibuffer-filter-by-content
  (kbd "f d") 'ibuffer-filter-by-directory
  (kbd "f f") 'ibuffer-filter-by-filename
  (kbd "f m") 'ibuffer-filter-by-mode
  (kbd "f n") 'ibuffer-filter-by-name
  (kbd "f x") 'ibuffer-filter-disable
  (kbd "g h") 'ibuffer-do-kill-lines
  (kbd "g H") 'ibuffer-update)
#+end_src

* Centaur-Tabs
| COMMAND                     | DESCRIPTION               | KEYBINDING       |
|-----------------------------+---------------------------+------------------|
| centaur-tabs-mode           | /Toggle tabs globally/      | SPC t c          |
| centaur-tabs-local-mode     | /Toggle tabs local display/ | SPC t C          |
| centaur-tabs-forward        | /Next tab/                  | g <right> or g t |
| centaur-tabs-backward       | /Previous tab/              | g <left> or g T  |
| centaur-tabs-forward-group  | /Next tab group/            | g <down>         |
| centaur-tabs-backward-group | /Previous tab group/        | g <up>           |

#+begin_src emacs-lisp :tangle yes
(defun exclude-centaur-tabs-from-buffer (buffer)
  "Returns non-nil if BUFFER should be excluded from Centaur Tabs."
  (or (string-prefix-p "*" (buffer-name buffer))
      (string= (buffer-name buffer) "*doom*")
      (string= (buffer-name buffer) "*scratch*")
      (string= (buffer-name buffer) "*Messages*")
      (string-prefix-p "*Treemacs-scoped-Buffer-Perspective" (buffer-name buffer))))

(defun hide-centaur-tabs-in-buffer  (buffer)
  "Returns non-nil if BUFFER should be excluded from Centaur Tabs."
  (or (string-prefix-p "*" (buffer-name buffer))
      (string= (buffer-name buffer) "*doom*")
      (string= (buffer-name buffer) "*scratch*")
      (string= (buffer-name buffer) "*Messages*")
      (with-current-buffer buffer
        (derived-mode-p 'treemacs-mode))))

(setq centaur-tabs-set-bar 'over
      centaur-tabs-set-icons t
      centaur-tabs-gray-out-icons 'buffer
      centaur-tabs-height 24
      centaur-tabs-set-modified-marker t
      centaur-tabs-style "bar"
      centaur-tabs-modified-marker "•"
      centaur-tabs-hide-tab-function #'exclude-centaur-tabs-from-buffer
      centaur-tabs-hide-tab-function #'hide-centaur-tabs-in-buffer)

(map! :leader
      :desc "Toggle tabs globally" "t TAB" #'centaur-tabs-mode
      :desc "Toggle tabs local display" "t <backtab>" #'centaur-tabs-local-mode)

(evil-define-key 'normal centaur-tabs-mode-map (kbd "g <right>") 'centaur-tabs-forward        ; default Doom binding is 'g t'
                                               (kbd "g <left>")  'centaur-tabs-backward       ; default Doom binding is 'g T'
                                               (kbd "g <down>")  'centaur-tabs-forward-group
                                               (kbd "g <up>")    'centaur-tabs-backward-group)
#+END_SRC

* Dashboard
** Splash
Replacing the default splsh with something more personal

*** Image
Set an custom Slash image

#+begin_src emacs-lisp :tangle yes
(setq fancy-splash-image (concat doom-private-dir "splash/hlb-splash.png"))
#+end_src

