roles/doom/files/doom/.config/doom/config.el
;;; $DOOMDIR/config.el -*- lexical-binding: t; -*-

(setq auto-save-default t make-backup-files t)

(beacon-mode t)

(setq bookmark-default-file "~/.config/doom/bookmarks")

(map! :leader
      (:prefix ("b". "buffer")
       :desc "List bookmarks"                          "L" #'list-bookmarks
       :desc "Set bookmark"                            "m" #'bookmark-set
       :desc "Delete bookmark"                         "M" #'bookmark-set
       :desc "Save current bookmarks to bookmark file" "w" #'bookmark-save))

(global-auto-revert-mode 1)
(setq global-auto-revert-non-file-buffers t)

(setq fancy-splash-image (concat doom-private-dir "splash/hlb-splash.png"))
