roles/doom/files/doom/.config/doom/config.org
*** Ascii
Set asciiart as fallback

#+begin_src emacs-lisp :tangle yes
(defun dashboard-ascii ()
  (let* ((banner '("                                                                     .                "
                   "         .:  :                                                      :.               ."
                   "..-:.   ..  .::..                                                ..=......:    .-::.. "
                   "   ..::--::::-::===-====--.                             .:=---===+=-:--=-::::-:.      "
                   "   :.     .:-. ....: :**+.                               .=++. : ..    ..:.           "
                   "       .    .    .-:=-*++     -*+=.             .*++:    .*++::-..  ..                "
                   "   . .:-:. .=  ... :. ===     .++:    .=+++-.    =+=.     +==-=:::::....              "
                   "          ..:.::.=...:+==     :+=:      ++=      ===.     === +...       ..  .        "
                   "               -:..=+.===     :+=-      +==      ==+.    .+==  .-. :.........:        "
                   "       .:..::.::  ::: ==+     :=+:      ++=      -==.     +==-:-  =:.                 "
                   "     ..   .    ..:..  ==+     :++-      +=-      -==.    .+=+..-=- ...:=::.           "
                   "             :.....:= ==+     :+=-      +==      ===.    .+=+   -::-.  ..             "
                   "         ......=-.:-::===     :==-      ++=      =++.    .+++:=+-.....                "
                   "             ..   :   +++     :++-      ++=      =+*.     +==   ::-.....              "
                   "                 .:   *++     :**-    .=***:     =+*.     ***=-+:::..                 "
                   "           :::... =:=-+**     :*+        .  .    .+*.    .**=- .=.                    "
                   "               .::::. -*#     :+                   *     .##:.  -::                   "
                   "             .:.  .=::+*#     ..                   :     -##=   . ...                 "
                   "                 .:.  -*#:                               =#= -.-.                     "
                   "                     -  #=                               **: .                        "
                   "                        :*                              .* .-.                        "
                   "                       .::=                             =::   .                       "
                   "                        .--:                           .-.                            "
                   "                           -                          .- .                            "
                   "                            --.                     .:..                              "
                   "                              ..                   ..                                 "))
         (longest-line (apply #'max (mapcar #'length banner))))
    (put-text-property
     (point)
     (dolist (line banner (point))
       (insert (+doom-dashboard--center
                +doom-dashboard--width
                (concat line (make-string (max 0 (- longest-line (length line))) 32)))
               "\n"))
     'face 'doom-dashboard-banner)))

(setq +doom-dashboard-ascii-banner-fn #'dashboard-ascii)
#+end_src

** Menu

#+begin_src emacs-lisp :tangle yes
(add-to-list '+doom-dashboard-menu-sections
             '("Open RSS feed"
               :icon (nerd-icons-faicon "nf-fa-rss" :face 'doom-dashboard-menu-title)
               :when (featurep! :app rss +org)
               :face (:inherit (doom-dashboard-menu-title bold))
               :action elfeed))
#+end_src

* DOOM Theme
There are two ways to load a theme. Both assume the theme is installed and available. You can either set =doom-theme= or manually load a theme with the =load-theme= function.
To try out new themes: =M-x load-theme= or =SPC h t=.

#+begin_src emacs-lisp :tangle yes
(setq doom-theme 'doom-dracula
      xterm-color-preserve-properties t)
#+end_src

#+begin_src emacs-lisp :tangle no
(map! :leader
      :desc "Load new theme" "t t" #'load-theme)
#+end_src

* Editor
** Autoformat
Be gone

#+begin_src emacs-lisp :tangle yes
(setq-hook! 'prog-mode-hook +format-with nil)
(setq +format-on-save-enabled-modes nil)
#+end_src

** Indentation
I like 8 character tabs, it a callback to the old typewriter days.

#+begin_src emacs-lisp :tangle yes
(setq-default indent-tabs-mode nil
              tab-width 8)
(setq indent-line-function 'insert-tab)
#+end_src

** Scrolloff

#+begin_src emacs-lisp :tangle yes
(setq scroll-margin 8)
#+end_src

* Elfeed
An RSS reader in emacs

#+begin_src emacs-lisp :tangle yes
(require 'elfeed-goodies)
(elfeed-goodies/setup)
(setq elfeed-goodies/entry-pane-size 0.5)

(add-hook 'elfeed-search-mode-hook #'elfeed-update)

(evil-define-key 'normal elfeed-show-mode-map
  (kbd "J") 'elfeed-goodies/split-show-next
  (kbd "K") 'elfeed-goodies/split-show-prev)
(evil-define-key 'normal elfeed-search-mode-map
  (kbd "J") 'elfeed-goodies/split-show-next
  (kbd "K") 'elfeed-goodies/split-show-prev)

(map! :leader :desc "elfeed" "o n" #'elfeed)
#+end_src

* Fonts
Doom exposes five (optional) variables for controlling fonts in Doom:
+ =doom-font= -- the primary font to use
+ =doom-variable-pitch-font= -- a non-monospace font (where applicable)
+ =doom-big-font= -- used for =doom-big-font-mode=; use this for presentations or streaming.
+ =doom-unicode-font= -- for unicode glyphs
+ =doom-serif-font= -- for the =fixed-pitch-serif= face

See =C-h v doom-font= for documentation and more examples of what they accept.

#+begin_src emacs-lisp :tangle yes
(setq doom-font (font-spec :family "JetBrains Mono" :size 9.0 :weight 'normal :slant 'normal :height 1.0)
      doom-variable-pitch-font (font-spec :family "Ubuntu" :height 1.3)
      doom-big-font (font-spec :family "JetBrains Mono" :size 24.0)
      doom-unicode-font (font-spec :family "FiraCode Nerd Font Mono" :size 11))

(after! doom-themes
  (setq doom-themes-enable-bold t
        doom-themes-enable-italic t))

(custom-set-faces!
  '(font-lock-comment-face :slant italic)
  '(font-lock-keyword-face :slant italic))
#+end_src

If you or Emacs can't find your font, use =M-x describe-font= to look them up, =M-x eval-region= to execute elisp code, and =M-x doom/reload-font= to refresh your font settings.
If Emacs still can't find your font, it likely wasn't installed correctly. Font issues are rarely Doom issues!

** Font scale
Remaped the resizekeys to a more sane buttons

#+begin_src emacs-lisp :tangle yes
(map!
 :n "C-=" #'doom/reset-font-size
 :n "C-+" #'text-scale-increase
 :n "C--" #'text-scale-decrease)
#+end_src

* Identification
Some functionality uses this to identify you, e.g. GPG configuration, email clients, file templates and snippets.

#+begin_src emacs-lisp :tangle yes
(setq user-full-name "Jonas Schwind"
      user-mail-address "jonasschwind20021@gmx.de")
#+end_src

* Line Settings
This determines the style of line numbers in effect.
If set to =nil=, line numbers are disabled. For relative line numbers, set this to =relative=.

#+begin_src emacs-lisp :tangle yes
(setq display-line-numbers-type 'relative)
#+end_src

Automaticaly wrap lengthy lines.

#+begin_src emacs-lisp :tangle yes
(+global-word-wrap-mode +1)
#+end_src

* LSP

** Bindings
Setup lsp bindings to reseble my nvim bindigs

#+begin_src emacs-lisp :tangle yes
(map! :leader
      :desc "Rename symbol" "r n" #'lsp-rename
      :desc "Execute code action" "c a" #'lsp-execute-code-action
      :desc "Search workspace symbols" "v w s" #'lsp-ivy-workspace-symbol
      :desc "Find references" "v d" #'lsp-ui-peek-find-references
      :desc "Execute code action" "v c a" #'lsp-execute-code-action
      :desc "Find references" "v r r" #'lsp-find-references
      :desc "Rename symbol" "v r n" #'lsp-rename)

(map! :map lsp-mode-map
      :desc "Show documentation" "K" #'lsp-hover
      :desc "Go to definition" "g d" #'lsp-find-definition
      :desc "Jump to next diagnostic" "[ d" #'lsp-ui-peek-jump-forward
      :desc "Jump to previous diagnostic" "] d" #'lsp-ui-peek-jump-backward)

(after! company
  (map! :map company-active-map
        :desc "Select previous candidate" "C-p" #'company-select-previous
        :desc "Select next candidate" "C-n" #'company-select-next
        :desc "Complete selection" "C-y" #'company-complete-selection
        :desc "Complete" "C-SPC" #'company-complete))
#+end_src


** Java
Fix issues with lombok

#+begin_src emacs-lisp :tangle yes
(after! lsp-java
  (setq lombok-library-path (concat doom-data-dir "lombok.jar"))
  (unless (file-exists-p lombok-library-path)
    (url-copy-file "https://projectlombok.org/downloads/lombok.jar" lombok-library-path))
  (setq lsp-java-vmargs '("-XX:+UseParallelGC" "-XX:GCTimeRatio=4" "-XX:AdaptiveSizePolicyWeight=90" "-Dsun.zip.disableMemoryMapping=true" "-Xmx4G" "-Xms100m"))
  (push (concat "-javaagent:" (expand-file-name lombok-library-path)) lsp-java-vmargs))
#+end_src

* Minimap
#+begin_src emacs-lisp :tangle yes
(setq minimap-window-location 'right)
(map! :leader
      (:prefix ("t" . "toggle")
       :desc "Toggle minimap-mode" "m" #'minimap-mode))
#+end_src emacs-lisp

* Modeline
The modeline is the bottom status bar that appears in Emacs windows.  For more information on what is available to configure in the Doom modeline, check out:
https://github.com/seagle0128/doom-modeline

#+begin_src emacs-lisp :tangle yes
(set-face-attribute 'mode-line nil :font "Ubuntu-10")
(setq doom-modeline-height 25     ;; sets modeline height
      doom-modeline-bar-width 5   ;; sets right bar width
      doom-modeline-persp-name t  ;; adds perspective name to modeline
      doom-modeline-persp-icon t) ;; adds folder icon next to persp name
#+end_src

